<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>PayloadContent</key>
    <array>
        <dict>
            <key>DNSSettings</key>
            <dict>
                <key>DNSProtocol</key>
                <string>HTTPS</string>
                <key>ServerURL</key>
                <string>https://api.shields-ai.greplabs.com/dns-query</string>
            </dict>
            <key>PayloadDisplayName</key>
            <string>Shield AI DNS</string>
            <key>PayloadIdentifier</key>
            <string>com.shieldai.dns.settings</string>
            <key>PayloadType</key>
            <string>com.apple.dnsSettings.managed</string>
            <key>PayloadUUID</key>
            <string>A1B2C3D4-E5F6-7890-ABCD-EF1234567890</string>
            <key>PayloadVersion</key>
            <integer>1</integer>
        </dict>
    </array>
    <key>PayloadDescription</key>
    <string>Configures your device to use Shield AI DNS-over-HTTPS for secure, ad-free browsing with AI-powered threat protection.</string>
    <key>PayloadDisplayName</key>
    <string>Shield AI DNS Protection</string>
    <key>PayloadIdentifier</key>
    <string>com.shieldai.dns.profile</string>
    <key>PayloadOrganization</key>
    <string>Shield AI</string>
    <key>PayloadRemovalDisallowed</key>
    <false/>
    <key>PayloadType</key>
    <string>Configuration</string>
    <key>PayloadUUID</key>
    <string>12345678-90AB-CDEF-1234-567890ABCDEF</string>
    <key>PayloadVersion</key>
    <integer>1</integer>
</dict>
</plist>
